Repository: Storik4pro/cdpiui
Catalog: GoodbyeDPI_UI/Strings/*/GoodCheckAdditionalSettings.resw
Source language: en_us
Languages: ru

# AddressTextBlock.Text
source: Mapping addresses
ru: Адреса сопоставления

# AutomaticConnectivityTestTextBlock.Header
source: Automatic connection check
ru: Автоматическая проверка подключения

# ConnectivityTestURLs.Header
source: URL for connection test
ru: URL-адрес для теста подключения

# GGC.Header
source: Automatically match to nearby Google Global Cache (GGC) servers
ru: Автоматически подбирать для ближайших серверов Google Global Caсhe (GGC)

# GGCAddr.Header
source: Google Global Cache (GGC) Server Mapping URLs
ru: URL-адреса сопоставления серверов Google Global Cache (GGC)

# InternalTimeout.Header
source: Internal timeout
ru: Внутренний тайм-аут

# NativeResolver
source: Native (Recommended)
ru: Нативный (рекомендуется)

# Resolver.Description
source: Curl is generally more stable. The native version is faster.
ru: Curl, как правило, работает стабильнее. Нативный вариант работает быстрее

# Resolver.Header
source: Resolver
ru: Режим запросов

# ResolverRetryCount.Description
source: Maximum number of attempts to connect to the site
ru: Максимальное количество попыток подключения к сайту

# ResolverRetryCount.Header
source: Native resolver retries
ru: Повторные попытки нативного резолвера

# ResolverTimeout.Header
source: Native resolver timeout
ru: Тайм-аут нативного резолвера

# SkipCertVerifys.Header
source: Skip certificate compliance check
ru: Пропускать проверку соответствия сертификата

# TestCount.Description
source: The value must be greater than zero. The higher the value, the longer the selection process will take and the more accurate the final result will be.
ru: Значение должно быть больше нуля. Чем больше значение - тем дольше будет проходить подбор и тем точнее будет итоговый результат

# TestCount.Header
source: Number of attempts to test one strategy
ru: Количество попыток тестирования одной стратегии

# TimeOut.Header
source: Connection timeout
ru: Тайм-аут подключения

# GGCAddr.Description
source: Mapping addresses allow you to find the closest GGC server to your location. Addresses should be separated by a semicolon (";")
ru: Адреса сопоставления позволяют найти ближайший к вашему местоположению сервер GGC. Адреса следует указывать через точку с запятой (";")

# UseDOH.Header
source: Use DoH
ru: Использовать DoH

# DOHResolvers.Header
source: DoH resolvers
ru: DoH-резолверы

# DOHResolvers.Description
source: Addresses should be separated by semicolons (";")
ru: Адреса следует указывать через точку с запятой (";")

# Bin.Description
source: Path to the .BIN file. Expected characters are Latin characters, without spaces or characters prohibited by the file system.
ru: Путь к .BIN файлу. Ожидается латиница без пробелов и запрещенных файловой системой символов.

# RequestsTextBlock.Text
source: Requests
ru: Запросы
